In [1]:
#Creating and Manipulating DataFrames

In [3]:
import pandas as pd

In [5]:
student_data=pd.DataFrame(
    {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [23, 25, 22, 24, 23],
    'Gender': ['F', 'M', 'M', 'M', 'F'],
    'Score': [85, 78, 92, 70, 88]})

In [7]:
student_data

      Name  Age Gender  Score
0    Alice   23      F     85
1      Bob   25      M     78
2  Charlie   22      M     92
3    David   24      M     70
4      Eva   23      F     88

In [9]:
student_data.loc[0:2]

      Name  Age Gender  Score
0    Alice   23      F     85
1      Bob   25      M     78
2  Charlie   22      M     92

In [11]:
stu_Filter=student_data[student_data['Gender']=='F']

In [13]:
stu_Filter

    Name  Age Gender  Score
0  Alice   23      F     85
4    Eva   23      F     88

In [17]:
student_data['Score1']=student_data['Score']
student_data['Score2']=student_data['Score']
student_data['Age1']=student_data['Age']

In [19]:
student_data

      Name  Age Gender  Score  Score1  Score2  Age1
0    Alice   23      F     85      85      85    23
1      Bob   25      M     78      78      78    25
2  Charlie   22      M     92      92      92    22
3    David   24      M     70      70      70    24
4      Eva   23      F     88      88      88    23

In [21]:
student_data.drop('Age1',axis=1)

      Name  Age Gender  Score  Score1  Score2
0    Alice   23      F     85      85      85
1      Bob   25      M     78      78      78
2  Charlie   22      M     92      92      92
3    David   24      M     70      70      70
4      Eva   23      F     88      88      88

In [23]:
student_data=student_data.drop('Age1',axis=1)
student_data=student_data.drop(columns=['Score1','Score2'],axis=1)
student_data

      Name  Age Gender  Score
0    Alice   23      F     85
1      Bob   25      M     78
2  Charlie   22      M     92
3    David   24      M     70
4      Eva   23      F     88

In [25]:
student_data=student_data.drop(3,axis=0)
student_data

      Name  Age Gender  Score
0    Alice   23      F     85
1      Bob   25      M     78
2  Charlie   22      M     92
4      Eva   23      F     88

In [29]:
stu_Filter2=student_data[(student_data['Gender']=='F') & (student_data['Score']>85)]
stu_Filter2

  Name  Age Gender  Score
4  Eva   23      F     88

In [31]:
student_data.sort_values(by='Score',ascending=False,inplace=True)

In [33]:
student_data

      Name  Age Gender  Score
2  Charlie   22      M     92
4      Eva   23      F     88
0    Alice   23      F     85
1      Bob   25      M     78

In [35]:
def Grading(Score):
    if Score >= 90:
        return 'A'
    elif Score <= 90 and Score >= 80:
        return 'B'
    elif Score <= 80 and Score >= 70:
        return 'C'
    elif Score <= 70 and Score >= 60:
        return 'D'
    else:
        return 'F'

student_data['Grade']=student_data['Score'].apply(Grading)
student_data

      Name  Age Gender  Score Grade
2  Charlie   22      M     92     A
4      Eva   23      F     88     B
0    Alice   23      F     85     B
1      Bob   25      M     78     C

In [37]:
#DataFrame Operations

In [39]:
sales_data=pd.DataFrame(
    {'Month': ['Jan', 'Feb', 'Mar', 'Jan', 'Feb', 'Mar'],
    'Product': ['A', 'A', 'A', 'B', 'B', 'B'],
    'Sales': [150, 200, 250, 300, 400, 500]}
)

In [41]:
sales_data

  Month Product  Sales
0   Jan       A    150
1   Feb       A    200
2   Mar       A    250
3   Jan       B    300
4   Feb       B    400
5   Mar       B    500

In [43]:
sales_data.groupby('Product').sum('Sales')

         Sales
Product
A          600
B         1200

In [45]:
sales_data.loc[sales_data.groupby('Product')['Sales'].idxmax()]

  Month Product  Sales
2   Mar       A    250
5   Mar       B    500

In [47]:
total=sales_data.groupby('Product')['Sales'].transform('sum')
sales_data['Percentage']=(sales_data['Sales']/total)*100
sales_data

  Month Product  Sales  Percentage
0   Jan       A    150   25.000000
1   Feb       A    200   33.333333
2   Mar       A    250   41.666667
3   Jan       B    300   25.000000
4   Feb       B    400   33.333333
5   Mar       B    500   41.666667

In [49]:
#Handling Missing Data

In [51]:
employee_data=pd.DataFrame(
    {'Name': ['John', 'Doe', 'Jane', 'Anna', 'Smith'],
    'Department': ['HR', 'Finance', None, 'IT', 'HR'],
    'Salary': [50000, 60000, 55000, None, 58000]}
)
employee_data

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane       None  55000.0
3   Anna         IT      NaN
4  Smith         HR  58000.0

In [53]:
employee_data.isnull().sum()

Name          0
Department    1
Salary        1
dtype: int64

In [55]:
Dept_Mode=employee_data['Department'].mode()[0]
Dept_Mode

'HR'

In [59]:
employee_data['Department']=employee_data['Department'].fillna(value=Dept_Mode)
employee_data

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT      NaN
4  Smith         HR  58000.0

In [61]:
Sal_mean=employee_data['Salary'].mean()
employee_data['Salary']=employee_data['Salary'].fillna(value=Sal_mean)
employee_data

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT  55750.0
4  Smith         HR  58000.0

In [63]:
employee_data.isnull().sum()

Name          0
Department    0
Salary        0
dtype: int64

In [65]:
employee_data=employee_data.dropna()
employee_data

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT  55750.0
4  Smith         HR  58000.0

In [67]:
#Series Operations

In [69]:
temp = pd.Series([23, 21, 20, 25, 27, 30, 28, 22, 24, 26])
temp

0    23
1    21
2    20
3    25
4    27
5    30
6    28
7    22
8    24
9    26
dtype: int64

In [71]:
mean_val=temp.mean()
median_val = temp.median()
std_val = temp.std()

In [79]:
mean_val

24.6

In [77]:
median_val

24.5

In [81]:
std_val

3.204163957519444

In [83]:
temperature_celcius = (temp-32)*5/9
temperature_celcius

0   -5.000000
1   -6.111111
2   -6.666667
3   -3.888889
4   -2.777778
5   -1.111111
6   -2.222222
7   -5.555556
8   -4.444444
9   -3.333333
dtype: float64

In [87]:
temp.idxmax()

5

In [89]:
temp.idxmin()

2

In [91]:
temp.sort_values(ascending=True)

2    20
1    21
7    22
0    23
8    24
3    25
9    26
4    27
6    28
5    30
dtype: int64

In [93]:
temp.sort_values(ascending=False)

5    30
6    28
4    27
9    26
3    25
8    24
0    23
7    22
1    21
2    20
dtype: int64

In [95]:
#Merging dataframes

In [97]:
orders = pd.DataFrame({'OrderID': [1, 2, 3, 4, 5],
'CustomerID': [101, 102, 103, 104, 101],
'Product': ['A', 'B', 'A', 'C', 'B']
})

In [99]:
orders

   OrderID  CustomerID Product
0        1         101       A
1        2         102       B
2        3         103       A
3        4         104       C
4        5         101       B

In [101]:
customers = pd.DataFrame(
    {'CustomerID': [101, 102, 103, 104],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Location': ['New York', 'Los Angeles', 'Chicago', 'Houston']}
)

In [103]:
customers

   CustomerID     Name     Location
0         101    Alice     New York
1         102      Bob  Los Angeles
2         103  Charlie      Chicago
3         104    David      Houston

In [105]:
merged_df = pd.merge(orders,customers,on="CustomerID")

In [107]:
merged_df

   OrderID  CustomerID Product     Name     Location
0        1         101       A    Alice     New York
1        2         102       B      Bob  Los Angeles
2        3         103       A  Charlie      Chicago
3        4         104       C    David      Houston
4        5         101       B    Alice     New York

In [113]:
grouped = merged_df.groupby('Location')['Name'].size().reset_index(name='Total Orders')
grouped

      Location  Total Orders
0      Chicago             1
1      Houston             1
2  Los Angeles             1
3     New York             2